bench_result_20G/value-16384.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1310720 --value_size=16384 --benchmarks=fillrandom,stats,readrandom --write_buffer_size=67108864 >> /home/eros/workspace-lsm/Thanoskv2/bench_result_20G/value-16384.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 8589934592
Keys:       16 bytes each
Values:     16384 bytes each (8192 bytes after compression)
Entries:    1310720
RawSize:    20500.0 MB (estimated)
FileSize:   10260.0 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 1.71799e+10 GB
fillrandom   :      13.822 micros/op; 1131.5 MB/s 18.12 s

write in SSD size (MB):4641.83
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2      128         7        0     20506
  1        1      128         1        0        20
  2       46    11778         0        0        20

readrandom   :       5.192 micros/op; 3012.6 MB/s (1310720 of 1310720 found) 6.80 s
done~~

pmem allocs 776177
Final Use NVM: 8.56376 GB
Remainder of NVM space : 1.71799e+10 GB

--------------------------------------------------------
random write            latency       throughput
fillrandom   :      13.822 micros/op; 1131.5 MB/s 18.12 s
--------------------------------------------------------
random read             latency       throughput
readrandom   :       5.192 micros/op; 3012.6 MB/s (1310720 of 1310720 found) 6.80 s

memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s